tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "heroku/brew"

brew "ack" # grep for devs
brew "asdf" # version manager for multiple runtimes
brew "automake" # autogen makefile
brew "awscli" # cli for Amazon Web Services
brew "bat" # better cat with syntax highlighting
brew "cmake" # crossplatfomr build automation
brew "coreutils" # unix tools
brew "container-diff" # docker container diffing tool
brew "deno" # TypeScript runtime
brew "exa" # Modern ls replacement
brew "fd" # faster/easier find alternative
brew "fork-cleaner" # github old/inactive fork cleanup tool
brew "fzf" # fuzzy finder
brew "git" # distributed revision control system
brew "openssl" # openssl crypto toolkit
brew "gifsicle" # gif file manipulator
brew "git-delta" # fancy fit diff tool
brew "gnupg" # gnu Pretty Good Privacy (PGP)
brew "go" # tool for managing go source code
brew "grc" # generic colouriser
brew "hub" # git wrapper with github project features
brew "hyperscan" # high performance regex
brew "imagemagick" # image manipulation tools
brew "jq" # command line json processor
brew "kubernetes-cli" # kubernetes-cli
brew "lcov" # ui for gcov test coverage
brew "libpq" # PostgreSQL
brew "libsodium" # NaCl (salt) networking and cryptography library
brew "mackup" # mac application settings sync
brew "mas" # mac app store cli
brew "mkcert" # make locally trusted dev certs
brew "nvm" # node version manager
brew "nss" # MDN network security services
brew "openssl@1.1" # OpenSSL
brew "overmind" # Process manager for Procfile-based applications and tmux
brew "pinentry-mac"  # Pinentry for GPG on Mac
brew "poppler" # PDF utilities
brew "postgres" # PostgreSQL database
brew "pygments" # generic syntax highlighter
brew "protobuf" # Protocol buffers (Google's data interchange format)
brew "ripgrep" # (rg) Search tool like grep and The Silver Searcher
brew "ruby-build" # install various versions of ruby
brew "shellcheck" # static analtsis and lint toold for (ba)sh scripts
brew "socat" # socket cat (netcat on roids)
brew "ssh-copy-id" # install your public key on remote machines
brew "swiftlint" # enforce Swift style and conventions
brew "tesseract" # OCR engine
brew "thefuck" # command line typo fixer
brew "tldr" # simplified and community-driven man pages
brew "tree" # display directories as trees
brew "wget" # web get - intenet file retreiver
brew "xz" # data compressor with high compression ratio
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-syntax-highlighting" # Fish shell-like syntax highlighting for zsh

# cask "1password-cli"
cask "adoptopenjdk8"
cask "android-file-transfer"
cask "android-studio"
cask "appcleaner"
cask "barrier"
cask "brave-browser"
cask "dash"
cask "divvy"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "hyperdock"
cask "insomnia"
cask "iterm2"
# cask "keepingyouawake"
# cask "orka"
cask "ngrok"
cask "plex-media-server"
cask "postman"
cask "react-native-debugger"
# cask "sizeup" # compare with divvy and hyperdock
cask "sketch"
cask "skype"
cask "smartgit"
cask "steam"
# cask "subler"
cask "sublime-text"
cask "spotify"
cask "the-unarchiver"
cask "tableplus"
cask "transmission"
# cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
# cask "vmware-fusion"
# cask "vnc-viewer"
cask "whatsapp"
cask "zoom"

# mas "1Blocker", id: 1107421413
# mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Harvest", id: 506189836
# mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
# mas "StopTheMadness", id: 1376402589
# mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
