tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"
brew "automake"
brew "openssl@1.1"
brew "xz"
brew "cmake"
brew "coreutils"
brew "container-diff"
brew "exa"
brew "fd"
brew "fork-cleaner"
brew "git"
brew "openssl"
brew "gnupg"
brew "go"
brew "grc"
brew "hub"
brew "hyperscan"
brew "jq"
# brew "kubernetes-cli"
brew "lcov"
brew "libsodium"
brew "mackup"
brew "mas"
brew "mkcert"
brew "nvm"
brew "nss"
# brew "openconnect"
brew "overmind"
brew "pinentry-mac"
brew "protobuf"
brew "ripgrep"
brew "rbenv"
brew "ruby-build"
brew "shellcheck"
brew "socat"
brew "ssh-copy-id"
brew "thefuck"
brew "tldr"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# cask "1password-cli"
cask "adoptopenjdk"
cask "android-studio"
cask "appcleaner"
cask "docker"
cask "divvy"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "hyperdock"
cask "insomnia"
cask "iterm2"
# cask "keepingyouawake"
# cask "orka"
cask "postgres"
# cask "sizeup" # compare with divvy and hyperdock
cask "shuttle"
cask "sketch"
cask "skype"
cask "smartgit"
cask "steam"
# cask "subler"
cask "sublime-text"
cask "spotify"
cask "the-unarchiver"
cask "tableplus"
cask "transmission"
# cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
# cask "vmware-fusion"
# cask "vnc-viewer"
cask "whatsapp"
cask "zoomus"

# mas "1Blocker", id: 1107421413
# mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
# mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
# mas "StopTheMadness", id: 1376402589
# mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
